# Тесты для счетов (входное значение, ожидаемый результат)
account_test_data = [
    (73654108430135874305, "TypeError"),
    ("646864736788947795890000", "ValueError"),
    ("35383033474447895ABC", "ValueError"),
    ("12345", "ValueError"),
    ("73654108430135874305", "**4305"),
    ("64686473678894779589", "**9589"),
    ("35383033474447895560", "**5560"),
]

# Тесты для карт  (входное значение, ожидаемый результат)
card_test_data = [
    (7365410843013587, "TypeError"),
    ("64686473678894779589", "ValueError"),
    ("3538303347447ABC", "ValueError"),
    ("12345", "ValueError"),
    ("4108430135874305", "4108 43** **** 4305"),
    ("6473678894779589", "6473 67** **** 9589"),
    ("3033474447895560", "3033 47** **** 5560"),
]

# Тесты для форматера реквезитов (входное значение, ожидаемый результат)
format_requesite_test_data = [
    (1596837868705199, "TypeError"),
    ("Visa Classic", "IndexError"),
    ("8990922113665229", "ValueError"),
    ("Счет 646869", "ValueError"),
    ("MasterCard 7158300734726758", "MasterCard 7158 30** **** 6758"),
    ("Счет 73654108430135874305", "Счет **4305"),
    ("Visa Platinum 8990 9221 1366 5229", "Visa Platinum 8990 92** **** 5229"),
]
